Repository: wolneykien/pam_pkcs11
Catalog: po/*.po
Languages: ru

source: Smartcard authentication starts
ru: Начата аутентификация по токену

source: Please insert your %s or enter your username.
ru: Пожалуйста, вставьте %s или введите имя пользователя.

source: Error 2302: PKCS#11 module failed loading
ru: Ошибка 2302: невозможно загрузить модуль PKCS#11

source: Error 2304: PKCS#11 module could not be initialized
ru: Ошибка 2302: невозможно инициализировать модуль PKCS#11

source: Error 2306: No suitable token available
ru: Ошибка 2306: нет подходящего токена

source: Please insert your smart card called "%.32s".
ru: Пожалуйста, вставьте токен с пометкой "%.32s".

source: Please insert your smart card.
ru: Пожалуйста, вставьте токен.

source: Error 2308: No smartcard found
ru: Ошибка 2308: не найден токен

source: Error 2310: No smartcard found
ru: Ошибка 2310: не найден токен

source: %s found.
ru: Найден %s.

source: Error 2312: open PKCS#11 session failed
ru: Ошибка 2312: невозможно начать сеанс PKCS#11

source: Error 2314: Slot login failed
ru: Ошибка 2314: невозможно получить доступ к слоту

source: Welcome %.32s!
ru: Добро пожаловать, %.32s!

source: %s PIN:
ru: Введите PIN-код токена %s:

source: Error 2316: password could not be read
ru: Ошибка 2316: не удалось получить пароль

source: Error 2318: Empty smartcard PIN not allowed.
ru: Ошибка 2318: пустой PIN-код у токена не допускается

source: Enter your %s PIN on the pinpad
ru: Введите PIN-код токена %s на панели ввода

source: Error 2320: Wrong smartcard PIN
ru: Ошибка 2320: Неверный PIN-код

source: Error 2322: No certificate found
ru: Ошибка 2322: не обнаружен сертификат

source: verifying certificate
ru: Проверка сертификата

source: Error 2324: Certificate has expired
ru: Ошибка 2324: истёк срок действия сертификата

source: Error 2326: Certificate not yet valid
ru: Ошибка 2326: срок действия сертификата еще не наступил

source: Error 2328: Certificate signature invalid
ru: Ошибка 2328: неверная подпись сертификата

source: Error 2330: Certificate invalid
ru: Ошибка 2330: неверный сертификат

source: Error 2332: setting PAM userentry failed
ru: Ошибка 2332: невозможно определить имя пользователя для токена

source: Error 2334: No matching user
ru: Ошибка 2334: нет подходящего пользователя

source: Error 2336: No matching certificate found
ru: Ошибка 2336: нет подходящего сертификата

source: Checking signature
ru: Проверка подписи

source: Error 2338: Getting random value failed
ru: Ошибка 2338: не удалось получить псевдо-случайное число

source: Error 2340: Signing failed
ru: Ошибка 2340: не удалось сформировать подпись

source: Error 2342: Verifying signature failed
ru: Ошибка 2342: не удалось проверить подпись

source: Cannot change the password on your smart card.
ru: Невозможно поменять пароль на токене.

source: Smart card
ru: Токен
